Section_4_Real_Workload_Validation/Experiment13/data/raw/case-B/sustained-ramp/trial_022/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 34.811ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 34.627ms, rate sampling interval: 84ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.97ms   20.70ms 348.42ms   95.35%
    Req/Sec   351.74     54.55   797.00     89.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.83ms
 75.000%   36.58ms
 90.000%   45.44ms
 99.000%  156.41ms
 99.900%  250.88ms
 99.990%  312.06ms
 99.999%  331.52ms
100.000%  348.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.487     0.000000            1         1.00
      29.887     0.100000        12013         1.11
      30.607     0.200000        24061         1.25
      31.263     0.300000        35690         1.43
      31.983     0.400000        47789         1.67
      32.831     0.500000        59772         2.00
      33.279     0.550000        65518         2.22
      33.823     0.600000        71453         2.50
      34.495     0.650000        77510         2.86
      35.327     0.700000        83396         3.33
      36.575     0.750000        89243         4.00
      37.471     0.775000        92161         4.44
      38.591     0.800000        95160         5.00
      39.839     0.825000        98153         5.71
      41.343     0.850000       101126         6.67
      43.167     0.875000       104066         8.00
      44.191     0.887500       105563         8.89
      45.439     0.900000       107029        10.00
      46.943     0.912500       108526        11.43
      48.863     0.925000       110005        13.33
      51.743     0.937500       111489        16.00
      54.015     0.943750       112237        17.78
      56.703     0.950000       112970        20.00
      60.223     0.956250       113713        22.86
      65.087     0.962500       114456        26.67
      73.087     0.968750       115199        32.00
      80.127     0.971875       115572        35.56
      89.407     0.975000       115942        40.00
      99.967     0.978125       116314        45.71
     114.111     0.981250       116685        53.33
     127.807     0.984375       117057        64.00
     135.039     0.985938       117242        71.11
     143.103     0.987500       117428        80.00
     151.551     0.989062       117616        91.43
     159.871     0.990625       117801       106.67
     168.319     0.992188       117985       128.00
     172.159     0.992969       118080       142.22
     176.383     0.993750       118173       160.00
     180.863     0.994531       118264       182.86
     186.239     0.995313       118357       213.33
     193.023     0.996094       118451       256.00
     196.607     0.996484       118496       284.44
     200.319     0.996875       118543       320.00
     203.775     0.997266       118590       365.71
     207.487     0.997656       118636       426.67
     212.991     0.998047       118682       512.00
     216.703     0.998242       118705       568.89
     226.687     0.998437       118729       640.00
     234.239     0.998633       118752       731.43
     241.663     0.998828       118775       853.33
     252.415     0.999023       118798      1024.00
     258.687     0.999121       118810      1137.78
     263.423     0.999219       118822      1280.00
     268.031     0.999316       118833      1462.86
     272.383     0.999414       118845      1706.67
     276.479     0.999512       118856      2048.00
     279.807     0.999561       118863      2275.56
     283.135     0.999609       118868      2560.00
     288.767     0.999658       118874      2925.71
     292.863     0.999707       118880      3413.33
     296.959     0.999756       118885      4096.00
     299.775     0.999780       118888      4551.11
     303.359     0.999805       118891      5120.00
     306.943     0.999829       118895      5851.43
     308.223     0.999854       118897      6826.67
     310.783     0.999878       118900      8192.00
     311.551     0.999890       118901      9102.22
     312.319     0.999902       118903     10240.00
     312.575     0.999915       118904     11702.86
     315.903     0.999927       118906     13653.33
     317.695     0.999939       118907     16384.00
     321.023     0.999945       118909     18204.44
     321.023     0.999951       118909     20480.00
     321.023     0.999957       118909     23405.71
     323.071     0.999963       118910     27306.67
     324.863     0.999969       118911     32768.00
     324.863     0.999973       118911     36408.89
     326.399     0.999976       118912     40960.00
     326.399     0.999979       118912     46811.43
     326.399     0.999982       118912     54613.33
     331.519     0.999985       118913     65536.00
     331.519     0.999986       118913     72817.78
     331.519     0.999988       118913     81920.00
     331.519     0.999989       118913     93622.86
     331.519     0.999991       118913    109226.67
     348.671     0.999992       118914    131072.00
     348.671     1.000000       118914          inf
#[Mean    =       37.967, StdDeviation   =       20.705]
#[Max     =      348.416, Total count    =       118914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  125961 requests in 3.00m, 102.47MB read
Requests/sec:    699.79
Transfer/sec:    582.93KB